[
    {
        "title": "Glasswall ICAP - Management UI",
        "link": "https://github.com/filetrust/icap-management-ui",
        "description": "The Management UI in the Glasswall ICAP Program, a dockerised expressJS server written in Typescript and Typescript-React and running in an AKS cluster. Also hosted on dockerhub under the name: glasswallsolutions/icap-management-ui."
    },
    {
        "title": "Rebuild API - Automated Performance Testing",
        "link": "https://github.com/filetrust/cloudsdk-rebuild-api-performance-tests",
        "description": "A Minimum Viable Product for demonstrations of the Automated Performance Tests on Glasswall's Rebuild API."
    },
    {
        "title": "Glasswall Engineering",
        "link": "https://engineering.glasswallsolutions.com/",
        "description": "Documentation and resources for users of Glasswall Solutions' products."
    },
    {
        "title": "Glasswall Rebuild for Email",
        "link": "https://glasswallsolutions.com/rebuild-for-email/",
        "description": "Integral part of the Cloud development team; working in .NET, docker and Kubernetes."
    },
    {
        "title": "jdmcserver",
        "link": "https://github.com/werzl/jdmcserver",
        "description": "One project I started with a friend recently, jdmcserver, is a Minecraft server hosted in an AWS EC2 instance. As well as a static frontend which communicates with an API hosted on AWS API Gateway. The API connects Lambda functions, which toggle the running status of the EC2 instance, and expose the server’s details."
    },
    {
        "title": "This Website!",
        "link": "https://github.com/werzl/CV",
        "description": "This CV is actually a React/Webpack static site.  I wanted to version-control the web pages for the CV, but also the content. I needed a way to quickly make a change and see it propogate instantly on the frontend. I decided to go with GitHub, in order to make it open. An added bonus is a free proof-read; if a friend or potential employer spots a mistake or wants to suggest an improvement, they can create a pull request on this repository! :)"
    }
]
